[
  {
    "buttonText": "1",
    "tooltipText": "Задания Java текстовое",
    "copyText": "Далее буду отправлять задания которые выдают на собеседовании. \nНеобходимо будет написать решение задачи на языке Java без каких либо комментариев, на основании шаблона кода. \nВсе классы должны содержать гетеры и сеттера, и модификаторы\nПри написании кода, расставь нормально пробелы.\nЕсли  решение задачи требует только удаление  комментария /* .... */ и замены нового кода, тогда нужно только показать фрагмент кода, который будет вставлен в замен блока комментария(+ список новых импортов в начало файла, если оно нужно), иначе показывать полностью решение (весь листинг решаемой задачи)\nИмена переменных нужно писать осмысленные в кэмэлкейсе с маленькой буквы.\nПри написании нужно учитывать следующие  пункты:\n1) Сначала очень коротко сформулируйте решение вслух до набора кода\n2) Пишите читаемый код, не переусложните его\n3) Учитывайте основные краевые случаи, используйте тест-кейсы\n4) При необходимости использовать String.split()\nДалее буду  присылать задания. Жди"
  },
  {
    "buttonText": "2",
    "tooltipText": "Голосовое задание Java",
    "copyText": "Необходимо написать учебную программу на языке JAVA по текстовому описанию. Программа не должна содержать комментарии на русском язуке.\nВсе должно бьыть максимально локонично, и с применением минимального количества библиотек.\nАлгоритм должен быть написан максимально продуктивным способом, чтобы количество операций (сложновть) было как можно меньше.\nСначала необходимо написать программу, а потом  очень короткое описание что она выполняет.\nДалее будет писать голосовое описание:"
  },
  {
    "buttonText": "3",
    "tooltipText": "Теория Java",
    "copyText": "\n Теория Java \nНа собеседовании будут задавать теоретические вопросы по языку Java\nНапиши короткий ответ, для произношения в слух на собеседовании. Сначала описание, потом если нужно очень короткий пример, если текстового описания будет недостаточно.\n1) Сначала коротко ответ\n2) более развернуто, но тоже сжато\n3) если нужно то короткий пример  строк на 10\nЖди вопросы..."
  },
  {
    "buttonText": "4",
    "tooltipText": "Террия PostgreSQL",
    "copyText": "Теория PostgreSQL  \nНа собеседовании будут задавать теоретические вопросы по языку PGSQL\nНапиши короткий ответ, для произношения в слух на собеседовании. Сначала описание, потом если нужно очень короткий пример, если текстового описания будет недостаточно.\n1) Сначала коротко ответ\n2) более развернуто, но тоже сжато\n3) если нужно то короткий пример  строк на 10\nЖди вопросы..."
  },
  {
    "buttonText": "5",
    "tooltipText": "hh.ru - тесты",
    "copyText": "Дальше буду отправлять тесты по \"Математическая статистика\"\nвопросы будут в виде тестов, нудно будет выбрать правильный ответ из предложенных. Написать номер ответа и  текст ответа.\nБез всякого рассуждения и решения\nЖди..."
  }
]